armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/MindMotion/MM32L0xx/MindMotion.MM32L0xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>MindMotion</vendor>
  <url>http://www.mindmotion.com.cn/Download/MDK_KEIL/</url>
  <name>MM32L0xx_DFP</name>
  <description>MindMotion MM32L0xx Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="1.0.8">
      First Release version of MM32L0xx Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>MindMotion</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package MindMotion</keyword>
    <keyword>MM32L0xx</keyword>
    <keyword>MM32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->


    <family Dfamily="MM32L0xx Series" Dvendor="MindMotion:132">
      <processor Dcore="Cortex-M0"  DcoreVersion="r0p0" Dfpu="0" Dmpu = "0" Dendian="Little-endian"/>
 
            <description>
MM32L0xx - ARM Cortex-M0 Core
Frequency up to 48 MHz, Flash up to 128 KB, SRAM up to 8 KB, Support power saving mode: sleep, and standby mode
Analog peripherals 10 channels x 12bit, 1us ADC, 1 x ADC, Up to 2 x UART, Up to 2 x SPI (18Mbit/s), 1 x I2C (400Kbit/s), CAN 2.0 B (1Mbit/s), USB 2.0 FS (12Mbit/s)
On-chip resources include : 1 x Advanced Timer, 1 x SysTick Timer, 2 x WDG , 1 x DMA supported, Clock: HSI (48MHz) and LSI (40KHz)
Core ARM Cortex-M0, 48 MHz 
Memory 8 kB RAM, 128 kB ROM 
Clock 48 MHz 
Communication Other 
Timer/Counter/PWM 
Analog 10-channel 12 bit ADC 
        </description>

     <!-- ************************  Subfamily 'MM32L05x'  **************************** -->
        <subFamily DsubFamily="MM32L05x">
        <processor Dclock="48000000"/>
 
      <!-- *************************  Device 'MM32L05x'  ***************************** -->
 	  <device Dname="MM32L050PF">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L050PF"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x0/PB_MM32L050.pdf"                   title="MM32L0x0 Product Brief"/>
		<book    name="Documents/MM32L0x0/DS_MM32L0x0.pdf"                   title="MM32L0x0 Datasheet"/>
	  
	  </device>	
		
      <device Dname="MM32L050PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L050PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x0/PB_MM32L050.pdf"                   title="MM32L0x0 Product Brief"/>
		<book    name="Documents/MM32L0x0/DS_MM32L0x0.pdf"                   title="MM32L0x0 Datasheet"/>

      </device>
	  
	  <device Dname="MM32L050NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L050NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x0/PB_MM32L050.pdf"                   title="MM32L0x0 Product Brief"/>
		<book    name="Documents/MM32L0x0/DS_MM32L0x0.pdf"                   title="MM32L0x0 Datasheet"/>
	  
	  </device>
	  
	  <device Dname="MM32L050TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L050TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x0/PB_MM32L050.pdf"                   title="MM32L0x0 Product Brief"/>
		<book    name="Documents/MM32L0x0/DS_MM32L0x0.pdf"                   title="MM32L0x0 Datasheet"/>

      </device> 
     	  
    
   	  <device Dname="MM32L051PF">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L051PF"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L051PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L051PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
