armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/MindMotion/MM32L0xx/MindMotion.MM32L0xx_DFP.pdsc
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
      <device Dname="MM32L061NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L061TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>
	
      </device>
      	
	  <device Dname="MM32L062PF">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L062PF"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L062.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>
      <device Dname="MM32L062PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L062PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L062.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>
      <device Dname="MM32L062NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L062NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L062.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>		  
	  <device Dname="MM32L062TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L062TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L062.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>		  
      </subFamily>
	   <!-- ************************  Subfamily 'MM32L07x'  **************************** -->
	    <subFamily DsubFamily="MM32L07x">
        <processor Dclock="48000000"/>
        
	   <!-- *************************  Device 'MM32L07x'  ***************************** -->

	 
	  <device Dname="MM32L072NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L072NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L072.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>	
	  <device Dname="MM32L072PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L072PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L072.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>
