armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/MindMotion/MM32L0xx/MindMotion.MM32L0xx_DFP.pdsc
    <condition id="CMSIS Core">
      <description>CMSIS CORE processor and device specific Startup files</description>
        <require Cclass="CMSIS" Cgroup="CORE"/>
		<require Dvendor="MindMotion:132" Dname="MM32L0*"/> 
	</condition>
  </conditions>
  
  
  <components>
    <!-- CMSIS-Core component not required, is coming from CMSIS Pack -->
  
    <!-- Startup MM32L0xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.7" condition="CMSIS Core">
      <description>System Startup for MindMotion MM32L0xx Series devices</description>
      <files>
        <file category="header"  name="Device/MM32L0xx/Include/HAL_device.h"/>
		<file category="header"  name="Device/MM32L0xx/Source/system_MM32L0xx.h"/>
		<file category="sourceC" name="Device/MM32L0xx/Source/system_MM32L0xx.c" attr="config"  version="1.0.7"/> 
        <file category="sourceAsm" name="Device/MM32L0xx/Source/KEIL_StartAsm/startup_MM32L0xx.s" attr="config" version="1.0.7" condition="Compiler ARMCC"/>
        
      </files>
    </component> 
  


 

  </components>
  

  <examples>
    <!-- MM32_MBL0xxPF_Board Core Board -->

	<example name="MM32_MBL0xxPF_Board GPIO LED blinky" doc="README.TXT" folder="Boards/MBL0xxPF_Boardreg/RegSample/GPIO_LED">
		<description>MM32_MBL0xxPF_Board Blinky example</description>             
		<board name="MM32_MBL0xxPF_Board" vendor="MindMotion"/>
		<project>   
			<environment name="uv" load="KEILPRJ/BLINK.uvprojx"/>
		</project>
		<attributes>
			<component Cclass="CMSIS"     Cgroup="CORE"/>
			<component Cclass="Device"    Cgroup="Startup"/>
			<category>Getting Started</category>
		</attributes>
	</example>
	
  </examples>
  
  
  <boards>
    <board vendor="MindMotion" name="MM32_MBL0xxPF_Board" revision="Ver 1.0" >
      <description>MindMotion MM32_MBL0xxPF_Board Development Board</description>
      <image small="Images/MiniBoard_small.jpg" large="Images/MiniBoard_big.jpg"/>
      <book category="schematic" name="Documents/boards/MM32_MiniBoard_Schematic_Ver1_1.pdf" title="MM32_MBL0xxPF_Board Schematics"/>
	  <book category="manual" name="Documents/boards/PB_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBL0xxPF_Board Product Brief"/>
	  <book category="setup" name="Documents/boards/QS_MiniBoard_Quick_Start_Guide_Ver1_2.pdf" title="MM32_MBL0xxPF_Board Quick Start Guide"/>
	  <book category="manual" name="Documents/boards/UM_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBL0xxPF_Board UserManual"/>
      <mountedDevice    deviceIndex="0" Dvendor="MindMotion:132" Dname="MM32L073PF"/>
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L07x"/>	  
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L06x"/>
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L05x"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="1"              name="Push-buttons: Reset"/>
      <feature type="LED"       n="2"              name="LEDs: Power, One user"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>

    </board>
  </boards>
  
  
</package>
